<%@ page language="java" contentType="text/html;charset=UTF-8" %>
<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <title>EL 테스트</title>
</head>
<body>
    <h2>EL의 연산자들</h2>
    <hr>
    \${200+100} : ${200+100} <br>
    \${200-100} : ${200-100} <br>
    \${200/100} : ${200/100} <br>
    \${200>100} : ${200>100} <br>
    \${200==100} : ${200==100} <br>
    \${200!=100} : ${200!=100} <br>
    \${ '10' - 10 } : ${ '10' - 10 } <br>   <%-- 문자열에 대해 사칙연산 처리 시, 자동으로 '숫자로 변환' 후 처리됨 --%>
    \${10 * "10" } : ${10 * "10" } <br>
    \${40 div 5 } : ${40 div 5 } <br>
    \${40 mod 5 } : ${40 mod 5 } <br>
    \${ 10 eq 10 } : ${ 10 eq 10 } <br>
    \${ 10 lt 10 } : ${ 10 lt 10 } <br>
    \${ 10 gt 10 } : ${ 10 gt 10 } <br>
    \${ 10 le 10 } : ${ 10 le 10 } <br>
    \${ 10 ge 10 } : ${ 10 ge 10 } <br>
    \${10 > 5 ? 'A' : 'B'} : ${10 > 5 ? 'A' : 'B'} <br>
    \${100+200+300} : ${100+200+300} <br>
    \${100+=200+=300} : ${100+=200+=300} <br>   <%-- EL 식에서 문자열 결합은 "+=" 를 사용한다 --%>
    \${"EL" += 12 += 34 += "-문자열 결합연산"} : ${"EL" += 12 += 34 += "-문자열 결합연산"} <br>
</body>
</html>